system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    (-26 -19 -16)
    (16 -19 -16)
    (16 0 -16)
    (-26 0 -16)

    (-26 -19 -1)
    (16 -19 -1)
    (16 0 -1)
    (-26 0 -1)

    (-26 -19 0.188)
    (16 -19 0.188)
    (16 0 0.188)
    (-26 0 0.188)

    (-26 -19 0.244)
    (16 -19 0.244)
    (16 0 0.244)
    (-26 0 0.244)

);

blocks
(
    hex (0 1 2 3 4 5 6 7) (42 19 50) simpleGrading (1 1 0.05)
    hex (4 5 6 7 8 9 10 11) (42 19 50) simpleGrading (1 1 1)
    hex (8 9 10 11 12 13 14 15) (42 19 4) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (1 2 6 5)
            (5 6 10 9)
            (9 10 14 13)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
            (4 8 11 7)
            (8 12 15 11)
        );
    }

    waterplane
    {
        type symmetryPlane;
        faces
        (
            (12 15 14 13)
        );
    }

    bottom
    {
        type symmetryPlane;
        faces
        (
            (0 3 2 1)
        );
    }
    side
    {
        type symmetryPlane;
        faces
        (
            (0 1 5 4)
            (4 5 9 8)
            (8 9 13 12)
        );
    }
    midPlane
    {
        type symmetryPlane;
        faces
        (
            (3 7 6 2)
            (7 11 10 6)
            (11 15 14 10)

        );
    }
);

mergePatchPairs
(
);


// ************************************************************************* //
