0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    //- Set patchGroups for constraint patches
    #includeEtc "caseDicts/setConstraintTypes"

    // MotroBike Settings
    inlet
    {
        type            zeroGradient;
    }

    outlet
    {
        type            fixedValue;
        value           $internalField;
    
    }


    hull
    {
        type            zeroGradient;
    }


    // // DTCHull Settings (p_rgh)
    // inlet
    // {
    //     type            fixedFluxPressure;
    //     value           $internalField;
    // }

    // outlet
    // {
    //     type            zeroGradient;
    // }

    // hull
    // {
    //     type            fixedFluxPressure;
    //     value           $internalField;
    // }

}

// ************************************************************************* //
